# Задание 1 

Посчитайте среднее время жизни пользователей, которые выставили более 100 оценок. Под временем жизни понимается разница между максимальным и минимальным значением столбца timestamp для данного значения userId

In [8]:
import pandas as pd

In [54]:
ratings = pd.read_csv('ratings.csv')

In [55]:
ratings_grouped = ratings.groupby('userId').count().reset_index()

In [56]:
ratings_filtered = ratings_grouped[ratings_grouped['rating']>100]

In [52]:
film_fans_user_ids = ratings_filtered['userId'].tolist()

In [57]:
ratings_timestamp = ratings[ ratings['userId'].isin(film_fans_user_ids)]

In [58]:
def groupby_function(ratings_timestamp):
            return ratings_timestamp.timestamp.max() - ratings_timestamp.timestamp.min()

In [82]:
print('Среднее время жизни пользователей составляет', \
      round(ratings_timestamp.groupby('userId').apply(groupby_function).mean()/86400,),'дней.')

Среднее время жизни пользователей составляет 464 дней.

# Задание 2 

Дана статистика услуг перевозок клиентов компании по типам (см. файл с кодом занятия). 

Необходимо сформировать две таблицы:

таблицу с тремя типами выручки для каждого client_id без указания адреса клиента

аналогичную таблицу по типам выручки с указанием адреса клиента

Обратите внимание, что в процессе объединения таблиц данные не должны теряться.

In [79]:
rzd = pd.DataFrame(
    {
        'client_id': [111, 112, 113, 114, 115],
        'rzd_revenue': [1093, 2810, 10283, 5774, 981]
    }
)
rzd
auto = pd.DataFrame(
    {
        'client_id': [113, 114, 115, 116, 117],
        'auto_revenue': [57483, 83, 912, 4834, 98]
    }
)
auto
air = pd.DataFrame(
    {
        'client_id': [115, 116, 117, 118],
        'air_revenue': [81, 4, 13, 173]
    }
)
air
client_base = pd.DataFrame(
    {
        'client_id': [111, 112, 113, 114, 115, 116, 117, 118],
        'address': ['Комсомольская 4', 'Энтузиастов 8а', 'Левобережная 1а', 'Мира 14', 'ЗЖБИиДК 1', 
                    'Строителей 18', 'Панфиловская 33', 'Мастеркова 4']
    }
)
client_base

clients_df = client_base.merge(rzd,how='left').merge(auto,how='left').merge(air,how='left')

In [80]:
clients_df[['client_id','rzd_revenue','auto_revenue','air_revenue']]

   client_id  rzd_revenue  auto_revenue  air_revenue
0        111       1093.0           NaN          NaN
1        112       2810.0           NaN          NaN
2        113      10283.0       57483.0          NaN
3        114       5774.0          83.0          NaN
4        115        981.0         912.0         81.0
5        116          NaN        4834.0          4.0
6        117          NaN          98.0         13.0
7        118          NaN           NaN        173.0

In [81]:
clients_df[['client_id','address','rzd_revenue','auto_revenue','air_revenue']]

   client_id          address  rzd_revenue  auto_revenue  air_revenue
0        111  Комсомольская 4       1093.0           NaN          NaN
1        112   Энтузиастов 8а       2810.0           NaN          NaN
2        113  Левобережная 1а      10283.0       57483.0          NaN
3        114          Мира 14       5774.0          83.0          NaN
4        115        ЗЖБИиДК 1        981.0         912.0         81.0
5        116    Строителей 18          NaN        4834.0          4.0
6        117  Панфиловская 33          NaN          98.0         13.0
7        118     Мастеркова 4          NaN           NaN        173.0

# Задание 3 

В задаче сквозной аналитики вам предоставили данные по местоположению пользователей. Т. е. для каждого user_id известна последовательность координат (широта/долгота), когда они требовались приложению для полноценной работы. Как бы вы добавили эти сведения в таблицу визитов и покупок?

In [90]:
visits = pd.DataFrame(
    {
        'user_id': [11, 22, 55, 11, 77],
        'source': ['ad', 'yandex', 'email', 'google', 'ad']
    }
)
visits = visits[['user_id', 'source']]
purchases = pd.DataFrame(
    {
        'user_id': [11, 22, 55, 11, 99],
        'category': ['Спорт', 'Авто', 'Дача', 'Спорт', 'Авто'],
    }
)
purchases = purchases[['user_id', 'category']]

In [91]:
merge_df = visits.merge(purchases, how='outer',on='user_id')

In [92]:
merge_df.drop_duplicates(subset = ['user_id', 'source','category'], keep = 'first', inplace = True)
merge_df

   user_id  source category
0       11      ad    Спорт
2       11  google    Спорт
4       22  yandex     Авто
5       55   email     Дача
6       77      ad      NaN
7       99     NaN     Авто

In [ ]:
Далее у нас есть геоданные. Можно их усреднить и привязать по user_id через left join.